{
    "body": [
        {
            "date": 1627177200498,
            "name": "Why I Like Feeling Sore",
            "content": "Sore... Everyone who intensely exercises knows this word like the back of their hands. \nFrom a little annoyance in your arm to being unable to move your legs, this inconvenience is often a reason to skip out on a day of exercise. \n\nBeing sore may seem like a completely awful part of every workout, however, controlled and healthy soreness should be embraced.\n\n## Mentality\nI believe that you should live life in its best light. Although there are multiple painful feelings that come along with soreness, soreness shows that you pushed past your limits (although normal exercise is perfectly healthy). Every time my muscles become sore after a dryland practice at swimming, I feel motivated to continue working hard because I know that I am trying my best. \n\n## Physically\nSoreness usually happens when muscles are pushed past their normal capacity, causing damage to muscle fibers. This results in the stiffness and pain that you may feel the day after a workout. I believe that my body is breaking down my muscles like a contractor demolishes a house. Even though the house may be gone, the skyscraper that will be built in its place is crucial for the development of the neighborhood. \n\nYou must mine through the coal to reach the diamonds *(Minecraft reference)*. You wouldn't stop mining just because you encountered coal on your first or second block. You would keep going because you know that there is light at the end of the tunnel. Healthy soreness is part of the ores you have to mine through to get to your goals. ",
            "author": "Jaden"
        },
        {
            "date": 1627226161585,
            "name": "5 Tips For Getting an A by a Straight A Student",
            "content": "Ahh... Middle school... A world where hormones are running rampant... and students are racing to the cafeteria. There's one thing that connects us all, **grades**. These are 5 tips for getting an A by a straight A student.\n\nThrough the strict oversight from my semi-tiger parents and summer preparation, I've successfully graduated middle school with a 4.00 GPA. \n\n## 1. Teachers Are Your Bosses\nMy mother lectured me a lot in the car, to the point where I would automatically try to tune out everything. Although in the moment, I really wanted to leave, in hindsight, what she said was pretty true. \n\nTeaches are your bosses in school. Middle school is very different from elementary school in the sense that in elementary school, your grades are determined by how well you did, however, in middle school, your grades are determined by both your grades **AND** how much your teachers like you.\n\nIn middle school, you have to respect your teachers (excluding teachers who do illegal things). No matter how much you hate them, they're always right. \n\nIf your teacher likes you, they may have some extra lenience if you beg for a grade round-up. For example, if a good and respectful student asks for the teacher to round their grade up to an A when they have an 89%, the teacher would be more likely to change the grade. However, if a bad student who never participates and talks throughout the whole class, the teacher would be more likely to say screw you and refuse to change it. If your facing a meaner teacher, refer to the section called **Staying Above a Certain Percentage**.\n\nIn addition, teachers who like you more will be more likely to allow you to retake a test that you might have messed up on.\n\n### How To Get A Teacher To Like You?\nGreeting your teacher every class is a good start. Most of teachers will like you if you show that you want to learn from them. You need to show an effort in the class and participate. This may be easier for some people compared to others, however an attempt should be made.\n\n\n### Social Status?\nWell, you may say that's easier said than done. *\"What would my classmates think? I don't want to be alone the whole time.\"* I would try to find friends who understand the importance of grades. Also, my rule of thumb is to not over try and be labeled as a teacher's pet. I try to find the gray area between being a teacher's pet and being a normal person (~~background character~~).\n\n## 2. Always Take Re-takes\nIf your teacher gives you a chance to retake the assignment without any consequences, **ALWAYS** retake it. Not only does it give you another chance, it also allows you to prepare yourself because the content on the retake would be very similar to the original test. \n\nThere was once a time in my health class that I ended with a 90.07%. If I didn't retake a **7/8**, I would've ended with a B. \n\n## 3. ASK Questions\nYour teachers are being paid to be there for you. They're on your side and they want you to become successful. However, they aren't gods. They don't know if your struggling or if you don't understand something that is crucial for the next lesson. Don't be afraid to ask for help. If you can't raise your hand in the middle of the class, try to stay after class to ask the teacher a question. Even if the question is for clarification, you want to ensure that you are on the right path. Almost all of my writing questions included extra information that I believe if I didn't include, would have lowered my score. Almost all of that extra information was from my teachers answering my question. \n\nIn my 8th grade history class, my teacher tried to be really helpful, however, I received a 9/12 on one of our graphic organizers. I wasn't satisfied with a C even though my overall grade was an A, so after the next class, I stayed back for a couple of minutes asking why I received the grade. She explained that I didn't elaborate enough about some of the questions and that I provided vague answers. Fortunately, we were allowed to redo the assignment. \n\nIn addition, you could literally ask your teachers how to get As in their class. **Literally**\n\n### What about what others think?\nThis is a valid problem as a teenager, but one thing I learned from Ali Abdaal was that no one really cares about you, since everyone is so focused on themselves. If one of your friends asked for help from the teacher, you wouldn't think anything of it. It's fine to ask for help. \n\n## 4. Use Your Resources\nWe are currently in the 21st century where almost everything is on the internet. Since you're reading this blog right now, I'd assume you have access to the internet. \n\nNeed background information about the Boston Massacre? **Google it!** Having trouble with your math homework? **Khan Academy it!**\n\nNot only can you use the internet, you can ask your friends in the same class for help. Maybe their answers aren't as great as the teachers but you have access to them after school. \n\nDon't be afraid to ask for help! Everyone's in the same boat. \n\n## 5. Staying Above a Certain Percentage \nApps such as GradeView have greatly contributed to my overall grade. You need to know your grade  to improve it. Don't let the grade slip. \n\nFor easier classes, I usually try to stay above 95% because that gives me wiggle room if the teacher assigns a really hard assignment at the end of the quarter. \n\nFor harder ones, I try to get as many points as I can per assignment. If I just can't get a good score, I work as hard as I can to stay above 90%. If I can't, *it is what it is*. \n\nFind out what works for you.\n\nIf your teachers aren't updating your grade, remember in-person > email.\n\n***\n\nGrades are important, but they aren't the end of the world. Middle school is a mere 3 years of your life and grades aren't worth your mental health. Take care of yourself first and good luck! \n\n***\n\n## Rapid Fire Round\n\n#### 1. Take notes if you have a short memory span\n\n#### 2. Stay organized, don't lose papers\n\n#### 3. Look ahead, don't be \"jumped\" by an unknown assignment. \n\n#### 4. Don't procrastinate. Easier said than done, but would make life so much easier. \n~~personally haven't conquered this one~~\n",
            "author": "Jaden"
        },
        {
            "date": 1627354812888,
            "name": "Could I Really Build a PC?",
            "content": "Yeah, you could stick a laptop on a table and call it a day, but if you want to impress your friends and yourself, you have to put in the effort.\n\nHi, I'm Jaden and this is my journey through the cloudy desert of PC building.\n\n## Picking the Parts\nHundreds of computer parts for every use case are on the market. I spent countless hours researching the perfect *bang for your buck* parts. While watching [LTT](https://youtube.com/c/LinusTechTips), I decided to refer to the experts at [r/buildapcforme](https://www.reddit.com/r/buildapcforme/). \n\nThey suggested the **GTX 1660 Super** video card and the **Ryzen 5 3600** processor, and before you leave because the names are too complicated, \n\n#### Here's Basically What They Mean:\n*skip if you don't care*\n\nThe **GTX** refers to the prefix of the card. **GTX** means that the card doesn't have NVIDIA Raytracing capabilities built into the card. The first two numbers are the generation number. Higher is better. The second two numbers refer to the performance tier of the card. For example, the 1660 series is far better than the 1650 series, even though they're part of the same generation. Finally, the suffix is another performance tier. Normal cards are not given a suffix, while faster cards are given the **Super** suffix. Even faster cards are given the **Ti** suffix.\n\nMoving onto the processor, **Ryzen** is the name of a certain line of AMD Processors for Desktop. AMD is becoming the first choice for a lot of enthusiasts as Intel is lacking behind. The first number refers to the performance tier, which ranges from 3, 5, 7, to 9. The higher the number is, the more CPU cores and threads it has. The second number refers to the generation. The third number refers to the performance level and the last two numbers are used for extra speed bumps. There may be a letter behind the numbers that refers to the type. For example, a processor that has the letter G behind it has Intergrated graphics.\n\n\n#### RAM?\nRAM is crucial for everyday use as we all know that Chrome is really RAM hungry. Most people with laptops have 4-8 GB of RAM, and depending on the speed and generation, that could be enough. However, the general rule of thumb in the PC world for people that have a normal budget is to go with 16 GB+ of RAM. This allows me to use plenty of chrome tabs and play Modded Minecraft.\n\nI used to own an old 4 GB RAM laptop that could barely open 5 tabs. This upgrade has opened my eyes to a new world. Personally, 16 GB is more than enough for an average user. \n\n## Building \nPeople say that building a PC is like \"adult legos\". I think the hardest part is not breaking anything. You could easily short-circuit the parts. Even static electricity could damage them.\n\nI followed [BitWit's Step by Step PC Building Guide](https://youtu.be/IhX0fOUYd8Q) and referred to [LTT's First Person FOV Guide](https://youtu.be/v7MYOpFONCU). The whole process took a total of 5 hours, but more technologically advanced or experienced people could probably do it under an hour. Honestly, I would **love** to attempt a PC build speedrun if I had no consequences. \n\nThrough a bit of luck and a bit of hard work, **SOMEHOW**, I got the computer working on the first try. \n\nI think building a PC is the perfect experience for those who think their computers are slow, and I have learned a lot from my first try. ",
            "author": "Jaden"
        },
        {
            "date": 1627417509019,
            "name": "Ignite your FIRE",
            "content": "Imagine you just entered the work force... What now? Work and save for the next **30** years and then have a chance of retirement? Be a slave to money? Work a job you hate? Is that really how you want to live your life? Only being able to fully relax when you're old and tired? That isn't the life I want.\n\nFormer co-founder of Twitch, [Justin Kan](https://youtube.com/channel/UCfRtwc6K_VU9N4OjNnU2P7ghas), really shown me the life I want. He has a really cool group of friends and focuses on teaching young entrepreneurs and others. After selling Twitch to Amazon, he settled onto a farm, even though he is very well off. \n\nSelling a successful company is one way to financial independence. Another is the path of the [FIRE](https://www.reddit.com/r/Fire/) movement.\n\nMost people believe that financial independence is for a select amount of people with secure jobs or inheritance. However, the **FIRE** movement believes that the average person can reach it. The **FIRE** movement stands for Financial Independence Retire Early, although not all members aspire to retire early. This is achieved through extremely frugal spending and saving as much as you can. Also, another YouTuber by the name of [Graham Stephan](https://youtube.com/c/GrahamStephan) posts great videos about frugal spending and personal finance. \n\n### But, why?\nPersonally, I hate the idea of working for someone else almost everyday for the most of my life. I want to be young and energetic while I travel and live life. However, retirement for most people is around the age of 60. My goal is go retire early and seek fulfillment in my life. Financial Independence doesn't just mean never working for the rest of your life, instead, it means that you can pick and choose the projects you want to start. For example, you could start whatever company you want because even if the company fails, you could still live the exact same life as before. That is the life I aspire. \n**Travel** wherever, **start** whatever, **meet** whoever, I am the sole master of my life. \n\n### But, how?\nI'm not an expert on this subject, in fact, I've only seen the tip of the iceberg. Most plans include passive income, frugality, and compound interest. However, you're free to join me on my journey. Stick around and watch the progress or check in now and then. \n\nI hope this post introduced you to this untraditional path. I'll see ya there.\n\n",
            "author": "Jaden"
        },
        {
            "date": 1628037351901,
            "name": "Dev Log: 8/3/2021",
            "content": "I've ran out of blog ideas, so here's a dev log.\n\n## Project: Wyvern + Personal Website\nFor the past 2 weeks, I have been developing my personal website. I decided I wanted a page for each project on my website. I didn't want to type everything in Visual Studio Code, so I decided to create an app called **Wyvern**. Wyvern is a REST Client, which means it can send requests to my website and update the information. \n\nI'm currently working on handling the POST request.\n\n### Today's Work\n `+` Created a multipart formdata POST request client that sends both images and text.\n\n `+` Learned about [multer](https://www.npmjs.com/package/multer#readme), which is middleware for handling `multipart/form-data`.\n\n `+` Created a [mock server](https://github.com/InternetRamen/mockserver) to test requests.\n\n `+` On POST request receive, save all `screenshots` images and the `thumbnail` image.\n\n\nRight now, I basically have an object with all the text values such as the `name` and the `summary`, and two images.\n\n### To-Do\n - Pass image file paths into a function.\n - Pass text object into function.\n - Combine image file paths and text object into one object.\n - Add said object into JSON database.\n - Move everything from the mock server to the development site (basically just a copy of the main one, but I can break everything and still be okay).\n - **Unrelated:** Add a way to upload links to my linktree clone.\n\n\n PS: This is going to be my first blog post from **Wyvern**, let's see if it works :)",
            "author": "Jaden"
        }
    ]
}
